{"PMATH334": {"prereqs": [["MATH235", "MATH245"]], "description": "Rings, ideals, factor rings, homomorphisms, finite and infinite fields, polynomials and roots, field extensions, algebraic numbers, and applications, for example, to Latin squares, finite geometries, geometrical constructions, error-correcting codes. ", "title": "Introduction to Rings and Fields with Applications"}, "PMATH336": {"prereqs": [["MATH235", "MATH245"]], "description": "Groups, permutation groups, subgroups, homomorphisms, symmetry groups in 2 and 3 dimensions, direct products, Polya-Burnside enumeration. ", "title": "Introduction to Group Theory with Applications"}, "PMATH330": {"offered": ["F", "W", "S"], "prereqs": [["MATH225", "MATH126"], ["CS116", "CS136", "CS145"]], "description": "A broad introduction to Mathematical Logic. The notions of logical consequence and derivation are introduced in the settings of propositional and first order logic, with discussions of the completeness theorem and satisfiability. ", "antireqs": ["CS245", "SE212"], "title": "Introduction to Mathematical Logic"}, "PMATH331": {"offered": ["F", "W"], "prereqs": [["MATH237", "MATH247"]], "description": "Topology of Euclidean spaces, continuity, norms, completeness. Contraction mapping principle. Fourier series. Various applications, for example, to ordinary differential equations, optimization and numerical approximation. ", "title": "Applied Real Analysis"}, "PMATH332": {"offered": ["W", "S"], "prereqs": [["MATH237", "MATH247"]], "description": "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications. ", "antireqs": ["PHYS365"], "title": "Applied Complex Analysis"}, "PMATH333": {"prereqs": [["MATH138"], ["MATH237"]], "description": "The purpose of the course is to present the familiar concepts of calculus at a rigorous level and to provide students who took the MATH 137/MATH 138/MATH 237 sequence with the background needed to be successful in PMATH 351 and PMATH 352. Topics discussed include the completeness properties of the reals; the density of the rationals; the topology of real n-dimensional space: open and closed sets, connectedness, compactness (by open covers), the Heine-Borel theorem, completeness; sequences in real n-dimensional space: convergence, Cauchy sequences, subsequences, the Bolzano-Weierstrass theorem; multivariable functions: limits, point-wise and uniform continuity, the extreme value theorem, uniform convergence of sequences of functions, Taylor's theorem, term-by-term differentiation of power series; integration in real n-dimensional space: Riemann integrability, Fubini's theorem for continuous functions on rectangles, term-by-term integration of power series.", "antireqs": ["MATH247"], "title": "Introduction to Real Analysis"}, "CO370": {"offered": ["F", "W"], "prereqs": [["CO250", "CO350", "CO352", "CO255", "CO355", "CM340"]], "description": "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry and science. ", "antireqs": ["CO327"], "title": "Deterministic OR Models"}, "CO367": {"offered": ["W"], "prereqs": [["CO250", "CO350", "CO352", "CO255", "CM340"], ["MATH128!70", "MATH138", "MATH148"]], "description": "A course on the fundamentals of nonlinear optimization, including both the mathematical and the computational aspects. Necessary and sufficient optimality conditions for unconstrained and constrained problems. Convexity and its applications. Computational techniques and their analysis. ", "title": "Nonlinear Optimization"}, "AMATH382": {"offered": ["W"], "prereqs": [["MATH118", "MATH119", "MATH128", "MATH138", "MATH148"]], "description": "An introduction to dynamic mathematical modeling of cellular processes. The emphasis is on using computational tools to investigate differential equation-based models. A variety of cellular phenomena are discussed, including ion pumps, membrane potentials, intercellular communication, genetic networks, regulation of metabolic pathways, and signal transduction. ", "title": "Computational Modelling of Cellular Systems"}, "AMATH383": {"offered": ["W"], "prereqs": [["MATH106", "MATH114", "MATH115", "MATH136", "MATH146"], ["AMATH250", "AMATH251", "MATH350", "MATH218", "MATH228"], ["STAT202", "STAT206", "STAT211", "STAT220", "STAT230", "STAT231", "STAT241"]], "description": "An introduction to the mathematical modelling of biological processes, with emphasis on population biology. Topics include ecology, epidemiology, microbiology, and physiology. Techniques include difference equations, ordinary differential equations, partial differential equations, stability analysis, phase plane analysis, travelling wave solutions, mathematical software. Includes collaborative projects and computer labs. ", "title": "Introduction to Mathematical Biology"}, "STAT211": {"offered": ["W"], "prereqs": [["MATH109"]], "description": "Descriptive statistics, probability, discrete and continuous random variables. Sampling distributions and simple hypothesis testing. Introduction to survey sampling. ", "title": "Introductory Statistics and Sampling for Accounting"}, "CO446": {"offered": ["S"], "prereqs": [["CO342"]], "description": "This is an introductory course on matroid theory, with particular emphasis on graphic matroids and on topics that are applicable to graph theory. The topics include: matroid intersection and partition, graphic matroids, matroid connectivity, regular matroids, and representable matroids. Applications include: matching, disjoint paths, disjoint spanning trees, the 8-flow theorem for graphs, planarity testing, and recognizing totally unimodular matrices. ", "title": "Matroid Theory"}, "STAT450": {"offered": ["W"], "prereqs": [["STAT330"]], "description": "Discussion of inference problems under the headings of hypothesis testing and point and interval estimation. Frequentist and Bayesian approaches to inference. Construction and evaluation of tests and estimators. Large sample theory of point estimation. ", "title": "Estimation and Hypothesis Testing"}, "CO444": {"prereqs": [["MATH239", "MATH249"], ["PMATH336", "PMATH346", "PMATH347"]], "description": "An introduction to the methods of and some interesting current topics in algebraic graph theory. Topics covered will include vertex-transitive graphs, eigenvalue methods, strongly regular graphs and may include graph homomorphisms, Laplacians or knot and link invariants.", "title": "Algebraic Graph Theory"}, "CO442": {"offered": ["F"], "prereqs": [["CO342"], ["MATH235", "MATH245"]], "description": "Connectivity (Menger's Theorem, ear decomposition, and Tutte's Wheels Theorem) and matchings (Hall's Theorem and Tutte's Theorem). Flows: integer and group-valued flows, the flow polynomial, the 6-flow theorem. Ramsey theory: upper and lower bounds, explicit constructions. External graph theory: Turan's theorem, the Erdos-Gallai theorem. Probabilistic methods. ", "title": "Graph Theory"}, "STAT454": {"offered": ["W"], "prereqs": [["STAT332", "STAT372"]], "description": "Sources of survey error. Probability sampling designs, estimation and efficiency comparisons. Distribution theory and confidence intervals. Generalized regression estimation. Software for survey analysis. ", "title": "Sampling Theory and Practice"}, "CO440": {"prereqs": [["CO342"]], "description": "An in-depth study of one or two topics in graph theory. Course content may vary from term to term. Topics may include planar graphs, extremal graph theory, directed graphs, enumeration, algebraic graph theory, probabilistic graph theory, connectivity, graph embedding, colouring problems.", "title": "Topics in Graph Theory"}, "AMATH453": {"offered": ["F"], "prereqs": [["AMATH351"], ["AMATH353"]], "description": "A thorough discussion of the class of second-order linear partial differential equations with constant coefficients, in two independent variables. Laplace's equation, the wave equation and the heat equation in higher dimensions. Theoretical/qualitative aspects: well-posed problems, maximum principles for elliptic and parabolic equations, continuous dependence results, uniqueness results (including consideration of unbounded domains), domain of dependence for hyperbolic equations. Solution procedures: elliptic equations -- Green functions, conformal mapping; hyperbolic equations -- generalized d'Alembert solution, spherical means, method of descent; transform methods -- Fourier, multiple Fourier, Laplace, Hankel (for all three types of partial differential equations); Duhamel's method for inhomogeneous hyperbolic and parabolic equations. ", "title": "Partial Differential Equations 2"}, "AMATH451": {"offered": ["W"], "prereqs": [["AMATH351"]], "description": "A unified view of linear and nonlinear systems of ordinary differential equations in Rn. Flow operators and their classification: contractions, expansions, hyperbolic flows. Stable and unstable manifolds. Phase-space analysis. Nonlinear systems, stability of equilibria and Lyapunov functions. The special case of flows in the plane, Poincare-Bendixson theorem and limit cycles. Applications to physical problems will be a motivating influence. ", "title": "Introduction to Dynamical Systems"}, "AMATH456": {"offered": ["F"], "prereqs": [["MATH237", "MATH247"], ["AMATH250", "AMATH251", "MATH211", "ECE205", "MATH218", "MATH228"]], "description": "Concept of functional and its variations. The solution of problems using variational methods - the Euler-Lagrange equations. Applications include an introduction to Hamilton's Principle and optimal control. ", "title": "Calculus of Variations"}, "STAT340": {"offered": ["W", "S"], "prereqs": [["CS116", "CS126", "CS124", "CS134", "CS136", "CS138", "CS145", "SYDE221", "SYDE322"], ["STAT230!60", "STAT240"], ["STAT231", "STAT241"]], "description": "Building and validation of stochastic simulation models useful in computing, operations research, engineering and science. Related design and estimation problems. Variance reduction. The implementation and the analysis of the results. ", "antireqs": ["CM361", "STAT341", "CS437", "CS457"], "title": "Computer Simulation of Complex Systems"}, "AMATH455": {"offered": ["W"], "prereqs": [["AMATH332", "PMATH332", "PMATH352"], ["AMATH351"]], "description": "Feedback control with applications. System theory in both time and frequency domain, state-space computations, stability, system uncertainty, loopshaping, linear quadratic regulators and estimation. ", "title": "Control Theory"}, "CS365": {"offered": ["W"], "prereqs": [["CS240"], ["CS241"], ["MATH239", "MATH249"]], "description": "Finite automata and regular expressions. Pushdown automata and context-free grammars. Turing machines and undecidability. Time and space complexity. Diagonalization and hierarchies. CS 365 covers the material in CS 360 at an accelerated pace plus additional topics in computational complexity. ", "antireqs": ["CS360"], "title": "Models of Computation"}, "AMATH353": {"offered": ["W", "S"], "prereqs": [["AMATH231"], ["AMATH250", "AMATH251"], ["MATH211", "ECE205", "MATH218", "MATH228"]], "description": "Second order linear partial differential equations - the diffusion equation, wave equation, and Laplace's equation. Methods of solution - separation of variables and eigenfunction expansions, the Fourier transform. Physical interpretation of solutions in terms of diffusion, waves and steady states. First order non-linear partial differential equations and the method of characteristics. Applications are emphasized throughout. ", "antireqs": ["AMATH350", "PHYS364"], "title": "Partial Differential Equations 1"}, "CS360": {"offered": ["F", "W", "S"], "prereqs": [["CS240"], ["CS241"], ["MATH239", "MATH249"]], "description": "Models of computers including finite automata and Turing machines. Basics of formal languages with applications to the syntax of programming languages. Alternate characterizations of language classes. Proving unrecognizability. Unsolvable problems and their relevance to the semantics of programming. ", "antireqs": ["CS365"], "title": "Introduction to the Theory of Computing"}, "CS476": {"offered": ["W"], "prereqs": [["AMATH242", "CM271", "CS371", "CS370"], ["STAT231", "STAT241"]], "description": "The interaction of financial models, numerical methods, and computing environments. Basic computational aspects of option pricing and hedging. Numerical methods for stochastic differential equations, strong and weak convergence. Generating correlated random numbers. Time-stepping methods. Finite difference methods for the Black-Scholes equation. Discretization, stability, convergence. Methods for portfolio optimization, effect of data errors on portfolio weights. ", "title": "Numeric Computation for Financial Modeling"}, "CS200": {"offered": ["F", "W", "S"], "description": "Important concepts underlying major personal computer application categories; methodologies for learning and evaluating software; operating system and hardware design from the user's point of view, with implications for maintaining a personal computer. Students are encouraged to use their own personal computer for assignments. Social media and the effect of technology on society are explored throughout the course. ", "title": "Concepts for Advanced Computer Usage"}, "PMATH453": {"prereqs": [["PMATH354", "PMATH450"]], "description": "Banach and Hilbert spaces, bounded linear maps, Hahn-Banach theorem, open mapping theorem, closed graph theorem, topologies, nets, Hausdorff spaces, Tietze extension theorem, dual spaces, weak topologies, Tychonoff's theorem, Banach-Alaoglu theorem, reflexive spaces.", "title": "Functional Analysis"}, "CS475": {"offered": ["S"], "prereqs": [["AMATH242", "CM271", "CS371", "CS370"]], "description": "Basic concepts and implementation of numerical linear algebra techniques and their use in solving application problems. Special methods for solving linear systems having special features. Direct methods: symmetric, positive definite, band, general sparse structures, ordering methods.Iterative methods: Jacobi, Gauss-Seidel, SOR, conjugate gradient. Computing and using orthogonal factorizations of matrices. QR and SVD methods for solving least squares problems. Eigenvalue and singular value decompositions. Computation and uses of these decompositions in practice. ", "antireqs": ["CM372", "CS372", "CS472"], "title": "Computational Linear Algebra"}, "CS349": {"offered": ["W", "S"], "prereqs": [["CS241"], ["MATH115", "MATH136", "MATH146"]], "description": "An introduction to contemporary user interfaces, including the basics of human-computer interaction, the user interface design/evaluation process, the event abstraction, user interface components, specification of user interfaces, and the architectures within which user interfaces are developed. Implementation and evaluation of a typical user interface is considered. ", "title": "User Interfaces"}, "STAT221": {"offered": ["F", " W"], "prereqs": [["MATH128", "MATH138", "MATH148"], ["STAT220", "STAT230", "STAT240"]], "description": "Empirical problem solving, measurement systems, causal relationships, statistical models, estimation, confidence intervals, tests of significance. ", "title": "Statistics (Non-Specialist Level)"}, "STAT220": {"offered": ["F", "W"], "prereqs": [["MATH119", "MATH128", "MATH138", "MATH148"]], "description": "The laws of probability, discrete and continuous random variables, expectation, central limit theorem. ", "antireqs": ["STAT202", "STAT230", "STAT240"], "title": "Probability (Non-Specialist Level)"}, "AMATH391": {"offered": ["F"], "prereqs": [["AMATH231", "ECE342", "PHYS364", "SYDE252"], ["MATH114", "MATH115", "MATH136", "MATH146", "SYDE114"]], "description": "An introduction to contemporary mathematical concepts in signal analysis. Fourier series and Fourier transforms (FFT), the classical sampling theorem and the time-frequency uncertainty principle. Wavelets and multiresolution analysis. Applications include oversampling, denoising of audio, data compression and singularity detection. ", "title": "From Fourier to Wavelets"}, "AMATH390": {"offered": ["F"], "prereqs": [["MATH118", "MATH119", "MATH128", "MATH138", "MATH148"]], "description": "An introduction to some of the deep connections between mathematics and music. Topics covered include: acoustics, including pitch and harmonics, basic Fourier analysis, the mathematics behind the differing pitch and timbre of string, wind and percussion instruments, scales and temperaments, digital music, musical synthesis. ", "title": "Mathematics and Music"}, "AMATH473": {"offered": ["F"], "prereqs": [["AMATH373", "PHYS334"]], "description": "The Hilbert space of states, observables and time evolution. Feynman path integral and Greens functions. Approximation methods. Coordinate transformations, angular momentum and spin. The relation between symmetries and conservation laws. Density matrix, Ehrenfest theorem and decoherence. Multiparticle quantum mechanics. Bell inequality and basics of quantum computing. ", "title": "Quantum Theory 2"}, "CS115": {"offered": ["F", "W", "S"], "antireqs": ["BME121", "CS135", "CS137", "CS138", "CS145", "CHE121", "CIVE121", "ECE150", "GENE121", "NE111", "MSCI121", "SYDE121", "PHYS236"], "description": "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming. Function definition and application. Tracing via substitution. Design, testing, and documentation. Recursive data definitions. Lists and trees. Functional and data abstraction.", "title": "Introduction to Computer Science 1"}, "CS116": {"offered": ["F", "W", "S"], "prereqs": [["CS115", "CS135"]], "description": "This course builds on the techniques and patterns learned in CS 115 while making the transition to use of an imperative language. Generative and structural recursion. Mutation (assignment) and its role in an imperative language. Primitive types and basic I/O. Sequencing, selection, looping. Function definition and use. File and console I/O. Issues in computer science. ", "antireqs": ["CS136", "CS137", "CS138", "CS146", "PHYS239"], "title": "Introduction to Computer Science 2"}, "MATH207": {"offered": ["F", "W", "S"], "prereqs": [["MATH128", "MATH138", "MATH148"]], "description": "Multivariable functions and partial derivatives. Gradients. Optimization including Lagrange multipliers. Polar coordinates. Multiple integrals. Surface integrals on spheres and cylinders. Introduction to Fourier Series. ", "antireqs": ["AMATH231", "MATH212", "MATH212N", "MATH217", "MATH227", "MATH237", "MATH247"], "title": "Calculus 3 (Non-Specialist Level)"}, "CO380": {"offered": ["S"], "prereqs": [["MATH135", "MATH145"], ["MATH106", "MATH125", "MATH136"], ["MATH138", "MATH148"]], "description": "A course in problem solving. 100 problems are studied. Problems are taken mainly from the elementary parts of algebra, geometry, number theory, combinatorics and probability. ", "title": "Mathematical Discovery and Invention"}, "CO450": {"offered": ["F"], "prereqs": [["CO351", "CO255", "CO355"]], "description": "Characterizations of optimal solutions and efficient algorithms for optimization problems over discrete structures. Topics include network flows, optimal matchings, T-joins and postman tours, matroid optimization. ", "title": "Combinatorial Optimization"}, "CO452": {"prereqs": [["CO351", "CO255", "CO355"]], "description": "Formulation of problems as integer linear programs. Solution by branch-and-bound and cutting plane algorithms. Introduction to the theory of valid inequalities and polyhedral combinatorics.", "title": "Integer Programming"}, "CO453": {"prereqs": [["MATH229", "MATH239", "MATH249"], ["CO227", "CO250", "CO350", "CO255", "CO355", "CO352", "CM340"]], "description": "Network design under constraints on cost, capacity, distance and reliability. Approximation algorithms. The set covering problem. Tree solutions: spanning trees, Steiner trees, Gomory-Hu trees, optimum communication spanning trees. Connectivity, survivability and reliability. Network design with concentrators: the terminal layout problem. Location problems on networks.", "title": "Network Design"}, "CO454": {"offered": ["S"], "prereqs": [["MATH229", "MATH239", "MATH249"], ["CO227", "CO250", "CO350", "CO255", "CO355", "CO352", "CM340"]], "description": "An overview of practical optimization problems that can be posed as scheduling problems. Characterizations of optimal schedules. Simple and efficient combinatorial algorithms for easy problems. A brief overview of computational complexity, definition of P, NP, NP-Complete and NP-hard. Integer programming formulations, the Traveling Salesman Problem, heuristics, dynamic programming and branch-and-bound approaches. Polynomial-time approximation algorithms. ", "title": "Scheduling"}, "CO456": {"prereqs": [["MATH229", "MATH239", "MATH249"], ["CO227", "CO250", "CO350", "CO255", "CO355", "CO352", "CM340"]], "description": "A broad introduction to game theory and its applications to the modeling of competition and cooperation in business, economics and society. Two-person games in strategic form and Nash equilibria. Extensive form games, including multi-stage games. Coalition games and the core. Bayesian games, mechanism design and auctions.", "title": "Introduction to Game Theory"}, "AMATH250": {"offered": ["F", "W", "S"], "prereqs": [["MATH106", "MATH114", "MATH115", "MATH136", "MATH146", "NE112"], ["MATH128", "MATH138", "MATH148"]], "description": "Physical systems which lead to differential equations (examples include mechanical vibrations, population dynamics, and mixing processes). Dimensional analysis and dimensionless variables. Solving linear differential equations: first- and second-order scalar equations and first-order vector equations. Laplace transform methods of solving differential equations. ", "antireqs": ["AMATH251", "AMATH350", "MATH218", "MATH228"], "title": "Introduction to Differential Equations"}, "CO459": {"description": "An undergraduate seminar in optimization. The primary objective is to study recent work in specific areas of optimization. Course content may vary from term to term.", "title": "Topics in Optimization"}, "AMATH442": {"offered": ["F"], "prereqs": [["AMATH342"]], "description": "This course studies several classes of methods for the numerical solution of partial differential equations in multiple dimensions on structured and unstructured grids. Finite volume methods for hyperbolic conservation laws: linear and nonlinear hyperbolic systems; stability; numerical conservation. Finite element methods for elliptic and parabolic equations: weak forms; existence of solutions; optimal convergence; higher-order methods. Examples from fluid and solid mechanics. Additional topics as time permits. ", "title": "Computational Methods for Partial Differential Equations"}, "CS449": {"offered": ["S"], "prereqs": [["CS240"], ["CS241"]], "description": "An introduction to the fundamental theories, methods, and research in the design and evaluation of novel computational artifacts designed to meet real-world human needs. ", "antireqs": ["SYDE348"], "title": "Human-Computer Interaction"}, "CS350": {"offered": ["F", "W", "S"], "prereqs": [["CS240"], ["CS241"], ["CS246"], ["CS251", "ECE222"]], "description": "An introduction to the fundamentals of operating system function, design, and implementation. Topics include concurrency, synchronization, processes, threads, scheduling, memory management, file systems, device management, and security. ", "antireqs": ["ECE254", "MTE241", "SE350"], "title": "Operating Systems"}, "AMATH251": {"offered": ["F"], "prereqs": [["MATH106", "MATH114", "MATH115", "MATH136", "MATH146", "NE112"], ["MATH128", "MATH138", "MATH148"]], "description": "AMATH 251 is an advanced-level version of AMATH 250. Compared to AMATH 250, AMATH 251 offers a more theoretical treatment of differential equations and solution methods. In addition, emphasis will be placed on computational analysis of differential equations and on applications in science and engineering. ", "antireqs": ["AMATH250", "AMATH350", "MATH218", "MATH228"], "title": "Introduction to Differential Equations (Advanced level)"}, "CS442": {"offered": ["W"], "prereqs": [["CS240"]], "description": "An exposure to important concepts and issues in contemporary programming languages. Data types, abstraction, and polymorphism. Program structure. Lambda calculus and functional programming, logic programming, object-oriented programming. Semantics of programming languages. Critical comparison of language features and programming methodologies using examples drawn from a variety of programming languages including Lisp, Prolog, ML, Ada, Smalltalk, Icon, APL, and Lucid. Programming assignments involve the use of some of these languages. ", "title": "Principles of Programming Languages"}, "CS447": {"offered": ["W"], "prereqs": [["CS350"]], "description": "Introduces students to systematic testing of software systems. Software verification, reviews, metrics, quality assurance, and prediction of software reliability and availability. Related management issues. ", "antireqs": ["SE465"], "title": "Software Testing, Quality Assurance and Maintenance"}, "CS446": {"offered": ["W", "S"], "prereqs": [["CS350"]], "description": "Introduces students to the design, implementation, and evolution phases of software development. Software design processes, methods, and notation. Implementation of designs. Evolution of designs and implementations. Management of design activities. ", "antireqs": ["CS430", "SE464"], "title": "Software Design and Architectures"}, "CS445": {"offered": ["F", "W"], "prereqs": [["CS350"]], "description": "Introduces students to the requirements definition phase of software development. Models, notations, and processes for software requirements identification, representation, analysis, and validation. Cost estimation from early documents and specifications. ", "antireqs": ["SE463"], "title": "Software Requirements Specification and Analysis"}, "CS444": {"offered": ["W"], "prereqs": [["CS350", "SE350"]], "description": "Phases of compilation. Lexical analysis and a review of parsing. Compiler-compilers and translator writing systems. LEX and YACC. Scope rules, block structure, and symbol tables. Runtime stack management. Parameter passage mechanisms. Stack storage organization and templates. Heap storage management. Intermediate code. Code generation. Macros. ", "title": "Compiler Construction"}, "STAT337": {"offered": ["F"], "prereqs": [["STAT221!60", "STAT231", "STAT241"]], "description": "This course will provide an introduction to statistical methods in health research. Topics to be covered include types of medical data, measures of disease prevalence and incidence, age and sex adjustment of disease rates, sensitivity and specificity of diagnostic tests, ROC curves, measures of association between risk factors and disease, major sources of medical data in the Canadian context including surveys, registries, and clinical studies such as cohort studies, clinical trials and case-control studies. Papers from the medical literature will be used throughout to illustrate the concepts. Introduction to SAS for data analysis and an introduction to database management tools. ", "antireqs": ["HLTH333", "STAT232"], "title": "Introduction to Medical Statistics"}, "STAT334": {"offered": ["F", "S"], "prereqs": [["MATH237", "MATH247"], ["STAT230!60", "STAT240"], ["STAT231", "STAT241"]], "description": "Random variables and distribution theory, conditional expectations, moment and probability generating functions, change of variables, random walks, Markov chains, Markov processes. [Offered F,S]", "antireqs": ["STAT330", "STAT333"], "title": "Probability Models for Business and Accounting"}, "CO227": {"offered": ["F", "W"], "prereqs": [["MATH106", "MATH125", "MATH114", "MATH115", "MATH136", "MATH146"]], "description": "A broad introduction to the field of optimization, discussing applications, and solution techniques. Mathematical models for real life applications; algorithms: Simplex, Cutting Plane, and Branch & Bound; linear programming duality. ", "antireqs": ["CO250", "CO350", "CO352", "CO255", "CO355", "CM340"], "title": "Introduction to Optimization (Non-Specialist Level)"}, "STAT332": {"offered": ["F", "W", "S"], "prereqs": [["STAT231!60", "STAT241", "SYDE212!70"]], "description": "Designing sample surveys. Probability sampling designs. Estimation with elementary designs. Observational and experimental studies. Blocking, randomization, factorial designs. Analysis of variance. Designing for comparison of groups. ", "antireqs": ["BIOL361", "STAT322", "STAT372"], "title": "Sampling and Experimental Design"}, "STAT331": {"offered": ["F", "W", "S"], "prereqs": [["MATH235", "MATH245"], ["STAT231!60", "STAT241", "SYDE212!70"]], "description": "Modeling the relationship between a response variable and several explanatory variables (an output-input system) via regression models. Least squares algorithm for estimation of parameters. Hypothesis testing and prediction. Model diagnostics and improvement. Algorithms for variable selection. Nonlinear regression and other methods. ", "antireqs": ["ECON321", "STAT321", "STAT371", "STAT373", "SYDE334"], "title": "Applied Linear Models"}, "STAT330": {"offered": ["F", "W", "S"], "prereqs": [["MATH237", "MATH247"], ["STAT230!60", "STAT240"], ["STAT231", "STAT241"]], "description": "This course provides a mathematically rigorous treatment for topics covered in STAT 230 and 231, and to make essential extensions to the multivariate case. Maximum likelihood estimation. Random variables and distribution theory. Generating functions. Functions of random variables. Limiting distributions. Large sample theory of likelihood methods. Likelihood ratio tests. \rJoint probability (density) functions, marginal probability (density) functions, and conditional probability (density) functions of two or more random variables are discussed. Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions. Properties of the Multinomial and Bivariate Normal distributions are proved. Limiting distributions, including convergence in probability and convergence in distribution, are discussed. Important results, including the Weak Law of Large Numbers, Central Limit Theorem, Slutsky's theorem, and the Delta Method, are introduced with applications. The maximum likelihood method is discussed for the multi-parameter case. Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions. Tests for simple and composite hypotheses are constructed using the Likelihood Ratio Test. ", "antireqs": ["STAT334"], "title": "Mathematical Statistics"}, "STAT230": {"offered": ["F", "W", "S"], "prereqs": [["MATH135!60"], ["MATH127!70", "MATH128!70", "MATH117!60", "MATH137!60", "MATH147"]], "description": "This course provides an introduction to probability models including sample spaces, mutually exclusive and independent events, conditional probability and Bayes' Theorem. The named distributions (Discrete Uniform, Hypergeometric, Binomial, Negative Binomial, Geometric, Poisson, Continuous Uniform, Exponential, Normal (Gaussian), and Multinomial) are used to model real phenomena. Discrete and continuous univariate random variables and their distributions are discussed. Joint probability functions, marginal probability functions, and conditional probability functions of two or more discrete random variables and functions of random variables are also discussed. Students learn how to calculate and interpret means, variances and covariances particularly for the named distributions. The Central Limit Theorem is used to approximate probabilities. ", "antireqs": ["STAT220"], "title": "Probability"}, "STAT231": {"offered": ["F", "W", "S"], "prereqs": [["MATH119", "MATH128", "MATH138", "MATH148"], ["STAT220!70", "STAT230", "STAT240"]], "description": "This course provides a systematic approach to empirical problem solving which will enable students to critically assess the sampling protocol and conclusions of an empirical study including the possible sources of error in the study and whether evidence of a causal relationship can be reasonably concluded. The connection between the attributes of a population and the parameters in the named distributions covered in STAT 230 will be emphasized. Numerical and graphical techniques for summarizing data and checking the fit of a statistical model will be discussed. The method of maximum likelihood will be used to obtain point and interval estimates for the parameters of interest as well as testing hypotheses. The interpretation of confidence intervals and p-values will be emphasized. The Chi-squared and t distributions will be introduced and used to construct confidence intervals and tests of hypotheses including likelihood ratio tests. Contingency tables and Gaussian response models including the two sample Gaussian and simple linear regression will be used as examples. ", "antireqs": ["STAT221", "STAT241"], "title": "Statistics"}, "MATH218": {"offered": ["F", "S"], "prereqs": [["MATH118", "MATH119", "MATH128", "MATH138", "MATH148", "SYDE112"]], "description": "First order equations, second order linear equations with constant coefficients, series solutions, the Laplace transform method, systems of linear differential equations. Applications in engineering are emphasized. ", "antireqs": ["AMATH250", "AMATH251", "AMATH350", "AMATH351", "CIVE222", "ENVE223", "MATH211", "ECE205", "MATH212N", "MATH228", "ME203", "SYDE211"], "title": "Differential Equations for Engineers"}, "CS100": {"offered": ["F", "W", "S"], "description": "Using personal computers as effective problem solving tools for the present and the future. Effective use of spreadsheets to process, manipulate, and visualize numeric and textual information. Introduction to the Internet, World Wide Web, HTML, and XML. Algorithms underlying the functional components of web search engines and their influence on data access. Using wikis to publish, reshape, and organize data collaboratively. ", "title": "Introduction to Computing through Applications"}, "CS106": {"offered": ["W"], "prereqs": [["CS105"]], "description": "A continuation of the introduction to computer programming begun in CS 105. The use of programming, in conjunction with libraries, as a means of solving practical problems in art, design, and data processing. Basic text processing, manipulation of images and sound, handling and visualization of tabular and hierarchical data. Introductions to user interfaces, physical simulation, and object-oriented programming. ", "antireqs": ["BME121", "CS115", "CS135", "CS136", "CS145", "CHE121", "CIVE121", "ECE150", "GENE121", "NE111", "MSCI121", "SYDE121"], "title": "Introduction to Computer Programming 2"}, "CS105": {"offered": ["F"], "antireqs": ["BME121", "CS115", "CS135", "CS137", "CS145", "CHE121", "CIVE121", "ECE150", "GENE121", "NE111", "MSCI121", "PHYS236", "SYDE121"], "description": "An introduction to the fundamentals of computer programming through media computation. Students will learn to write interactive graphical programs. Fundamental language concepts such as variables, conditionals, loops, functions, and arrays. Programming concepts such as coding style, modular design, testing, and debugging. Media concepts such as 2D graphics drawing, input, animation, and image processing. ", "title": "Introduction to Computer Programming 1"}, "MATH211": {"offered": ["F", "W"], "prereqs": [["MATH119"]], "description": "Fourier series. Ordinary differential equations. Laplace transform. Applications to linear electrical systems. ", "antireqs": ["AMATH350", "MATH218", "MATH228"], "title": "Advanced Calculus 1 for Electrical and Computer Engineers"}, "MATH212": {"offered": ["F", "S"], "prereqs": [["MATH211", "ECE205"]], "description": "Triple integrals, cylindrical and spherical polar coordinates. Divergence and curl, applications. Surface integrals, Green's, Gauss' and Stokes' theorems, applications. Complex functions, analytic functions, contour integrals, Cauchy's integral formula, Laurent series, residues. ", "antireqs": ["AMATH231", "MATH207", "MATH217", "MATH227", "MATH237", "MATH247"], "title": "Advanced Calculus 2 for Electrical Engineers"}, "MATH213": {"offered": ["S"], "prereqs": [["MATH119"]], "description": "Fourier series. Differential equations. Laplace transforms. Applications to circuit analysis. ", "antireqs": ["AMATH250", "MATH211|ECE205", "MATH212N", "MATH218", "MATH228"], "title": "Advanced Mathematics for Software Engineers"}, "MATH215": {"offered": ["F", "W"], "antireqs": ["MATH106", "MATH114", "MATH115", "MATH136", "MATH146", "NE112"], "description": "Systems of linear equations; their representation with matrices and vectors; their generalization to linear transformations on abstract vector spaces; and the description of these linear transformations through quantitative characteristics such as the determinant, the characteristic polynomial, eigenvalues and eigenvectors, the rank, and singular values. [Offered F,W]", "title": "Linear Algebra for Engineering"}, "MATH217": {"offered": ["F", "W"], "prereqs": [["MATH118"]], "description": "Curves and surfaces in R3. Multivariable functions, partial derivatives, the chain rule, gradients. Optimization, Lagrange Multipliers. Double and triple integrals, change of variable. Vector fields, divergence and curl. Vector integral calculus: Green's theorem, the Divergence theorem and Stokes' theorem. Applications in engineering are emphasized. ", "antireqs": ["AMATH231", "CIVE221", "ENVE221", "MATH207", "MATH212", "ECE206", "MATH212N", "MATH227", "MATH237", "MATH247", "ME201"], "title": "Calculus 3 for Chemical Engineering"}, "CS454": {"offered": ["W", "S"], "prereqs": [["CS350", "SE350"]], "description": "An introduction to distributed systems, emphasizing the multiple levels of software in such systems. Specific topics include fundamentals of data communications, network architecture and protocols, local-area networks, concurrency control in distributed systems, recovery in distributed systems, and clock synchronization. ", "antireqs": ["ECE454"], "title": "Distributed Systems"}, "CS456": {"offered": ["F", "W", "S"], "prereqs": [["CS350", "ECE354"]], "description": "An introduction to network architectures and protocols, placing emphasis on protocols used in the Internet. Specific topics include application layer protocols, network programming, transport protocols, routing, multicast, data link layer issues, multimedia networking, network security, and network management. ", "antireqs": ["CS436", "ECE358", "ECE428"], "title": "Computer Networks"}, "CS457": {"offered": ["F"], "prereqs": [["CS246", "CS247"], ["STAT206", "STAT231", "STAT241"]], "description": "Basic techniques of system performance evaluation. Specific topics include: performance modeling, discrete event simulation, verification and validation of simulation models, analysis of simulation output, analysis of single server queue and queueing networks, modeling of computer systems, networks, and other queueing or non-queueing systems. ", "title": "System Performance Evaluation"}, "CS450": {"offered": ["W"], "prereqs": [["CS245", "SE212"], ["CS350", "ECE354", "MTE241", "SE350"]], "description": "The course is intended to provide the student with an appreciation of modern computer design and its relation to system architecture, compiler technology and operating system functionality. The course places an emphasis on design based on the measurement of performance and its dependency on parallelism, efficiency, latency and resource utilization. ", "antireqs": ["ECE429"], "title": "Computer Architecture"}, "AMATH361": {"offered": ["W"], "prereqs": [["AMATH231"], ["AMATH271", "PHYS263"], ["AMATH351"], ["AMATH353", "PHYS364"]], "description": "Stress and strain tensors; analysis of stress and strain. Lagrangian and Eulerian methods for describing flow. Equations of continuity, motion and energy, constitutive equations. Navier-Stokes equation. Basic equations of elasticity. Various applications. ", "title": "Continuum Mechanics"}, "CS452": {"offered": ["W", "S"], "prereqs": [["CS350", "SE350"]], "description": "Intended to give students experience with tools and techniques of real-time programming, this course includes not only issues of microcomputer architecture and a real-time programming language and operating system, but also hands-on experience programming a microcomputer for applications such as process control, data acquisition and communication. ", "title": "Real-time Programming"}, "AMATH242": {"offered": ["W", "S"], "prereqs": [["CS116", "CS136", "CS138", "CS146"], ["MATH235", "MATH245"], ["MATH237", "MATH247"]], "description": "A rigorous introduction to the field of computational mathematics. The focus is on the interplay between continuous models and their solution via discrete processes. Topics include: pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms and numerical integration. Applications are used as motivation. ", "antireqs": ["CS335", "CS370", "MTE204"], "title": "Introduction to Computational Mathematics"}, "CS458": {"offered": ["F", "W", "S"], "prereqs": [["CS350", "SE350"]], "description": "Security and privacy issues in various aspects of computing. Specific topics include: comparing security and privacy, program security, writing secure programs, controls against program threats, operating system security, formal security models, network security, Internet application security and privacy, privacy-enhancing technologies, database security and privacy, inference, data mining, security policies, physical security, economics of security, and legal and ethical issues. ", "antireqs": ["ECE458"], "title": "Computer Security and Privacy"}, "CS485": {"prereqs": [["CS341"], ["STAT206", "STAT230", "STAT240"]], "description": "Extracting meaningful patterns from random samples of large data sets. Statistical analysis of the resulting problems. Common algorithmic paradigms for such tasks. Central concepts: VC-dimension, margins of a classifier, sparsity and description length. Performance guarantees: generalization bounds, data dependent error bounds and computational complexity of learning algorithms. Common paradigms: neural networks, kernel methods and support-vector machines. Applications to data mining. ", "title": "Machine Learning: Statistical and Computational Foundations"}, "STAT435": {"offered": ["W"], "prereqs": [["STAT332", "STAT372"]], "description": "Statistical methods for improving processes based on observational data. Assessment of measurement systems. Strategies for variation reduction. Process monitoring, control and adjustment. Clue generation techniques for determining the sources of variability. Variation transmission. ", "title": "Statistical Methods for Process Improvements"}, "STAT436": {"offered": ["W"], "prereqs": [["STAT431"]], "description": "The objective of this course is to develop understanding and working knowledge of spatial models and analysis of spatial data. The course provides an introduction to the rudiments of statistical inference based on spatially correlated data. Methods of estimation and testing will be developed for geostatistical models based on variograms and spatial autogressive models. Concepts and application of methods will be emphasized through case studies and pro jects with health applications. ", "title": "Introduction to the Analysis of Spatial Data in Health Research"}, "STAT341": {"offered": ["F"], "prereqs": [["MATH237", "MATH247"], ["STAT230!60", "STAT240"], ["STAT231", "STAT241"]], "description": "Approximation and optimization of noisy functions. Simulation from univariate and multivariate distributions, multivariate normal distribution, mixture distributions and introduction to Markov Monte Carlo. Introduction to supervised statistical learning including discrimination methods. ", "antireqs": ["CS437", "STAT340"], "title": "Computational Statistics and Data Analysis"}, "CS348": {"offered": ["F", "W", "S"], "prereqs": [["CS240"]], "description": "The main objective of this course is to introduce students to fundamentals of database technology by studying databases from three viewpoints: those of the database user, the database designer, and the database administrator. It teaches the use of a database management system (DBMS) by treating it as a black box, focusing only on its functionality and its interfaces. Topics include: introduction to database systems, relational database systems, database design methodology, SQL and interfaces, database application development, concept of transactions, ODBC, JDBC, database tuning, database Administration, and current topics (distributed databases, data warehouses, data mining). ", "antireqs": ["CS338", "ECE356", "ECE456", "MSCI346"], "title": "Introduction to Database Management"}, "STAT431": {"offered": ["F", "W", "S"], "prereqs": [["STAT330"], ["STAT331", "STAT371"]], "description": "Review of the normal linear model and maximum likelihood estimation; regression models for binomial, Poisson and multinomial data; generalized linear models; and other topics in regression modelling. ", "title": "Generalized Linear Models and their Applications"}, "CO351": {"offered": ["F", "S"], "prereqs": [["CO250", "CO350", "CO352", "CO255", "CO355", "CM340"]], "description": "Review of linear programming. Shortest path problems. The max-flow min-cut theorem and applications. Minimum cost flow problems. Network simplex and primal-dual algorithms. Applications to problems of transportation, distribution, job assignments and critical-path planning. ", "title": "Network Flow Theory"}, "STAT433": {"offered": ["F"], "prereqs": [["STAT333"]], "description": "Point processes. Renewal theory. Stationary processes. Selected topics. ", "title": "Stochastic Processes"}, "PMATH433": {"prereqs": [["PMATH345", "PMATH346", "PMATH347"]], "description": "Model theory: the semantics of first order logic including the compactness theorem and its consequences, elementary embeddings and equivalence, the theory of definable sets and types, quantifier elimination, and omega-stability. Set theory: well-orderings, ordinals, cardinals, Zermelo-Fraenkel axioms, axiom of choice, informal discussion of classes and independence results. ", "title": "Model Theory and Set Theory"}, "CS341": {"offered": ["F", "W", "S"], "prereqs": [["CS240"], ["MATH239", "MATH249"]], "description": "The study of efficient algorithms and effective algorithm design techniques. Program design with emphasis on pragmatic and mathematical aspects of program efficiency. Topics include divide and conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph search and backtrack, problems without algorithms, NP-completeness and its implications. ", "antireqs": ["ECE406"], "title": "Algorithms"}, "CS343": {"offered": ["F", "W"], "prereqs": [["CS350", "SE350"]], "description": "An introduction to concurrent and parallel programming, with an emphasis on language constructs. Major topics include: exceptions, coroutines, atomic operations, critical sections, mutual exclusion, semaphores, high-level concurrency, deadlock, interprocess communication, process structuring, shared memory and distributed architectures. Students will learn how to structure, implement and debug concurrent programs. ", "antireqs": ["MTE241"], "title": "Concurrent and Parallel Programming"}, "MATH225": {"offered": ["F", "S"], "prereqs": [["MATH106", "MATH136", "MATH146"]], "description": "Vector spaces. Linear transformations and matrices. Inner products. Eigenvalues and eigenvectors. Diagonalization. Applications. ", "antireqs": ["MATH235", "MATH245"], "title": "Applied Linear Algebra 2"}, "MATH227": {"prereqs": [["MATH128", "MATH138"]], "description": "Directional derivative and the chain rule for multivariable functions. Optimization, Lagrange multipliers. Double and triple integrals on simple domains; transformations and Jacobians; change of variable in multiple integrals. Vector fields, divergence and curl. Vector integral calculus: Line and surface integrals, Green's Theorem, Stokes' Theorem, Gauss' Theorem, conservative vector fields.", "antireqs": ["AMATH231", "MATH207", "MATH212", "ECE206", "MATH212N", "MATH217", "MATH237", "MATH247"], "title": "Calculus 3 for Honours Physics"}, "CO372": {"offered": ["W"], "prereqs": [["AFM272", "ACTSC291", "ACTSC371", "BUS393W", "ECON371"], ["CO250", "CO350", "CO227!70", "CO352", "CM340", "CO255", "CO355"]], "description": "Applications of basic optimization models and techniques for decision making in financial markets. Quadratic optimization subject to linear equality constraints. Derivation of efficient portfolios and the Markowitz efficient frontier. The Capital Market Line. Practical portfolio optimization as a quadratic programming problem. A solution algorithm for quadratic programming problems. ", "title": "Portfolio Optimization Models"}, "CO331": {"offered": ["W"], "prereqs": [["MATH255", "MATH126", "MATH235", "MATH245"]], "description": "A first course in error-correcting codes. Linear block codes, Hamming-Golay codes and multiple error-correcting BCH codes are studied. Various encoding and decoding schemes are considered. ", "title": "Coding Theory"}, "CO330": {"offered": ["F"], "prereqs": [["MATH239", "MATH249"]], "description": "The algebra of formal power series. The combinatorics of the ordinary and exponential generating series. Lagrange's Implicit Function Theorem, applications to the enumeration of permutations, functions, trees and graphs. Integer partitions, geometric methods, enumerating linear transformations. Introduction to the pattern algebra, applications to the enumeration of strings. Lattice paths, Wiener-Hopf factorization. Enumeration under symmetries. ", "title": "Combinatorial Enumeration"}, "STAT322": {"offered": ["F"], "prereqs": [["STAT221", "STAT231", "STAT241"]], "description": "Planning sample surveys; simple random sampling; stratified sampling. Observational and experimental studies. Blocking, randomization, factorial designs. Analysis of variance. Applications of design principles. ", "antireqs": ["STAT332", "STAT372"], "title": "Sampling and Experimental Design (Non-Specialist Level)"}, "STAT241": {"offered": ["W"], "prereqs": [["MATH138", "MATH148"], ["STAT230", "STAT240"]], "description": "STAT 241 is an advanced-level enriched version of STAT 231. ", "antireqs": ["STAT221", "STAT231"], "title": "Statistics (Advanced Level)"}, "STAT240": {"offered": ["F"], "prereqs": [["MATH137!60", "MATH147"]], "description": "STAT 240 is an advanced-level enriched version of STAT 230. ", "antireqs": ["STAT220", "STAT230"], "title": "Probability (Advanced Level)"}, "MATH229": {"offered": ["F", "W"], "prereqs": [["MATH106", "MATH136", "MATH146"], ["MATH135", "MATH145"]], "description": "Introduction to graph theory: colourings, connectivity, Eulerian tours, planarity. Introduction to combinatorial analysis: elementary counting, generating series, binary strings. ", "antireqs": ["CO220", "MATH239", "MATH249"], "title": "Introduction to Combinatorics (Non-Specialist Level)"}, "MATH228": {"offered": ["F", "W"], "prereqs": [["MATH128", "MATH138"]], "description": "First-order equations, second-order linear equations with constant coefficients, series solutions and special functions, the Laplace transform method. Applications in physics and chemistry are emphasized. ", "antireqs": ["AMATH250", "AMATH251", "AMATH350"], "title": "Differential Equations for Physics and Chemistry"}, "CS138": {"offered": ["W"], "prereqs": [["CS137"]], "description": "Software abstractions via elementary data structures and their implementation; encapsulation and modularity; class and interface definitions; object instantiation; recursion; elementary abstract data types, including sequences, stacks, queues, and trees; implementation using linked structures and arrays; vectors and strings; memory models; automatic vs. dynamic memory management. ", "title": "Introduction to Data Abstraction and Implementation"}, "CS137": {"offered": ["F"], "description": "Review of fundamental programming concepts and their application. Procedures and parameter passing. Arrays and structures. Recursion. Sorting. Pointers and simple dynamic structures. Space and time analysis of designs. Design methodologies. ", "title": "Programming Principles"}, "CS136": {"offered": ["F", "W", "S"], "prereqs": [["CS116", "CS135!60", "CS145"]], "description": "This course builds on the techniques and patterns learned in CS 135 while making the transition to use an imperative language. It introduces the design and analysis of algorithms, the management of information, and the programming mechanisms and methodologies required in implementations. Topics discussed include iterative and recursive sorting algorithms; lists, stacks, queues, trees, and their application; abstract data types and their implementations. ", "antireqs": ["CS137", "CS138", "PHYS239"], "title": "Elementary Algorithm Design and Data Abstraction"}, "CS135": {"offered": ["F", "W"], "antireqs": ["BME121", "CS115", "CS137", "CS138", "CS145", "CHE121", "CIVE121", "ECE150", "GENE121", "NE111", "MSCI121", "SYDE121", "PHYS236"], "description": "An introduction to the fundamentals of computer science through the application of elementary programming patterns in the functional style of programming. Syntax and semantics of a functional programming language. Tracing via substitution. Design, testing, and documentation. Linear and nonlinear data structures. Recursive data definitions. Abstraction and encapsulation. Generative and structural recursion. Historical context. ", "title": "Designing Functional Programs"}, "CS230": {"offered": ["W"], "prereqs": [["CS116", "CS136", "CS138", "CS146"]], "description": "Basic computer architecture, organization, system services, and software. Typology of processors, memory, I/O devices and their performance. ", "antireqs": ["BME292", "CS241", "CS251", "SYDE192"], "title": "Introduction to Computers and Computer Systems"}, "PMATH348": {"prereqs": [["PMATH347"]], "description": "Fields, algebraic and transcendental extensions, minimal polynomials, Eisenstein's criterion, splitting fields, and the structure of finite fields. Sylow theorems and solvable groups. Galois theory. The insolvability of the quintic.", "title": "Fields and Galois Theory"}, "AMATH373": {"offered": ["W"], "prereqs": [["AMATH231"], ["AMATH271", "PHYS263"], ["PHYS234"]], "description": "Critical experiments and old quantum theory. Basic concepts of quantum mechanics: observables, wavefunctions, Hamiltonians and the Schroedinger equation. Uncertainty, correspondence and superposition principles. Simple applications to finite and extended one-dimensional systems, harmonic oscillator, rigid rotor and hydrogen atom. ", "antireqs": ["PHYS334"], "title": "Quantum Theory 1"}, "MATH52": {"offered": ["F", "W", "S"], "description": "The concepts included are limits, derivatives, antiderivatives and definite integrals. These concepts will be applied to solve problems of rates of change, maximum and minimum, curve sketching and areas. The classes of functions used to develop these concepts and applications are: polynomial, rational, trigonometric, exponential and logarithmic.", "title": "Pre-University Calculus"}, "PMATH399": {"description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Readings in Pure Mathematics"}, "AMATH271": {"offered": ["F"], "prereqs": [["MATH138"], ["PHYS121"], ["AMATH250", "AMATH251", "MATH228"], ["MATH235"], ["MATH237"]], "description": "Dimensional Analysis, Newtonian dynamics, gravity and the two-body problem, Introduction to Hamiltonian Mechanics, Non-conservative forces, Oscillations, Introduction to Special Relativity ", "antireqs": ["PHYS263"], "title": "Introduction to Theoretical Mechanics"}, "CS338": {"offered": ["F", "W", "S"], "prereqs": [["CS230", "CS234", "CS246", "CS330"]], "description": "A user-oriented approach to the management of large collections of data. Methods used for the storage, selection and presentation of data. Common database management systems. ", "antireqs": ["CS348", "CS448", "ECE456", "MSCI346"], "title": "Computer Applications in Business: Databases"}, "CO434": {"prereqs": [["PMATH336", "PMATH346", "PMATH347"]], "description": "Pairwise orthogonal latin squares. Transversal designs and finite planes. Balanced incomplete block designs, group divisible designs and pairwise balanced designs. Symmetric designs and Hadamard matrices. Recursive constructions. Wilson's fundamental construction.", "title": "Combinatorial Designs"}, "MATH117": {"offered": ["F"], "antireqs": ["MATH116", "MATH124", "MATH127", "MATH137", "MATH147"], "description": "Functions of engineering importance; review of polynomial, exponential, and logarithmic functions; trigonometric functions and identities. Inverse functions (logarithmic and trigonometric). Limits and continuity. Derivatives, rules of differentiation; derivatives of elementary functions. Applications of the derivative, max-min problems, Mean Value Theorem. Antiderivatives, the Riemann definite integral, Fundamental Theorems. Methods of integration, approximation, applications, improper integrals. ", "title": "Calculus 1 for Engineering"}, "MATH116": {"offered": ["F"], "antireqs": ["MATH117", "MATH124", "MATH127", "MATH137", "MATH147"], "description": "Functions: review of polynomials, exponential, logarithmic, trigonometric. Operations on functions, curve sketching. Trigonometric identities, inverse functions. Derivatives, rules of differentiation. Mean Value Theorem, Newton's Method. Indeterminate forms and L'Hopital's rule, applications. Integrals, approximations, Riemann definite integral, Fundamental Theorems. Applications of the integral. ", "title": "Calculus 1 for Engineering"}, "CO430": {"offered": ["W"], "prereqs": [["CO330"]], "description": "The algebra of Laurent series and Lagrange's Implicit Function Theorem, enumerative theory of planar embeddings (maps). The ring of symmetric functions: Schur functions, orthogonal bases, inner product, Young tableaux and plane partitions. Non-intersecting paths, sieve methods, partially ordered sets and Mobius inversion, strings with forbidden substrings, the Cartier-Foata commutation monoid. Introduction to the group algebra of the symmetric group, enumerative applications of sl(2). ", "title": "Algebraic Enumeration"}, "MATH114": {"offered": ["F"], "antireqs": ["MATH106", "MATH115", "MATH136", "MATH146", "NE112"], "description": "Vectors in 2- and 3-space and their geometry. Linear equations, matrices and determinants. Introduction to vector spaces. Eigenvalues and diagonalization. Applications. Complex numbers. ", "title": "Linear Algebra for Science"}, "CS330": {"offered": ["F", "W", "S"], "prereqs": [["CS116", "CS136", "CS138", "CS146"]], "description": "An introduction to information systems and their strategic role in business. Topics include types of information systems, organizational requirements, systems development strategies, decision support systems, data and information management, and information systems management, control and implementation. ", "antireqs": ["AFM241", "CS480|CS490", "MSCI441"], "title": "Management Information Systems"}, "MATH119": {"offered": ["W", "S"], "prereqs": [["MATH116", "MATH117", "MATH127", "MATH137", "MATH147"]], "description": "Elementary approximation methods: interpolation; Taylor polynomials and remainder; Newton's method, Landau order symbol, applications. Infinite series: Taylor series and Taylor's Remainder Theorem, geometric series, convergence test, power series, applications. Functions of several variables: partial derivatives, linear approximation and differential, gradient and directional derivative, optimization and Lagrange multipliers. Vector-valued functions: parametric representation of curves, tangent and normal vectors, line integrals and applications. ", "antireqs": ["MATH118", "MATH128", "MATH138", "MATH148"], "title": "Calculus 2 for Engineering"}, "MATH118": {"offered": ["W", "S"], "prereqs": [["MATH116", "MATH117", "MATH127", "MATH137", "MATH147"]], "description": "Methods of integration: by parts, trigonometric substitutions, partial fractions; engineering applications, approximation of integrals, improper integrals. Linear and separable first order differential equations, applications. Parametric curves and polar coordinates, arc length and area. Infinite sequences and series, convergence tests, power series and applications. Taylor polynomials and series, Taylor's Remainder Theorem, applications. ", "antireqs": ["MATH119", "MATH128", "MATH138", "MATH148"], "title": "Calculus 2 for Engineering"}, "CS335": {"offered": ["F", "W"], "prereqs": [["CS116", "CS136", "CS138", "CS146"], ["MATH136", "MATH146"], ["MATH237", "MATH247"], ["STAT231", "STAT241"]], "description": "An introduction to numerical methods for business and finance. Floating-point arithmetic, interpolation. Methods for portfolio optimization and contingent-claims valuation. Solution of nonlinear equations. Monte Carlo methods, lattice methods, simulation of hedging strategies. ", "antireqs": ["AMATH242|CM271|CS371", "CS370", "MTE204"], "title": "Computational Methods in Business and Finance"}, "STAT321": {"offered": ["W"], "prereqs": [["MATH225", "MATH126", "MATH235", "MATH245"], ["STAT221", "STAT231", "STAT241"]], "description": "Modeling the relationship between a response variable and several explanatory variables via regression models. Model diagnostics and improvement. Using regression models for forecasting, Exponential smoothing. Simple time series modeling. ", "antireqs": ["ECON321", "STAT331", "STAT371", "STAT373", "STAT443"], "title": "Regression and Forecasting (Non-Specialist Level)"}, "CO439": {"description": "An undergraduate seminar in combinatorics. The primary objective is to study current work in specific areas of combinatorics. Course content may vary from term to term.", "title": "Topics in Combinatorics"}, "CO327": {"offered": ["W", "S"], "prereqs": [["CO227", "CO250", "CO350", "CO352", "CO255", "CO355", "CM340"]], "description": "An applications-oriented course that illustrates how various mathematical models and methods of optimization can be used to solve problems arising in business, industry and science. ", "antireqs": ["CO370"], "title": "Deterministic OR Models (Non-Specialist Level)"}, "PMATH464": {"prereqs": [["PMATH345", "PMATH347"], ["PMATH346", "PMATH348"]], "description": "An introduction to algebraic geometry through the theory of algebraic\rcurves. General Algebraic Geometry: affine and projective algebraic sets,\rHilbert's Nullstellensatz, co-ordinate rings, polynomial maps, rational\rfunctions and local rings. Algebraic Curves: affine and projective plane\rcurves, tangency and multiplicity, intersection numbers, Bezout's theorem\rand divisor class groups.", "title": "Introduction to Algebraic Geometry"}, "MATH237": {"offered": ["F", "W", "S"], "prereqs": [["MATH106!70", "MATH125!70", "MATH136!60", "MATH146"], ["MATH128!70", "MATH138!60", "MATH148"]], "description": "Calculus of functions of several variables. Limits, continuity, differentiability, the chain rule. The gradient vector and the directional derivative. Taylor's formula. Optimization problems. Mappings and the Jacobian. Multiple integrals in various co-ordinate systems. ", "antireqs": ["MATH207", "MATH212", "ECE206", "MATH212N", "MATH217", "MATH227"], "title": "Calculus 3 for Honours Mathematics"}, "MATH235": {"offered": ["F", "W", "S"], "prereqs": [["MATH106!70", "MATH125!70", "MATH136!60", "MATH146"]], "description": "Orthogonal and unitary matrices and transformations. Orthogonal projections, Gram-Schmidt procedure, best approximations, least-squares. Inner products, angles and orthogonality, orthogonal diagonalization, singular value decomposition, applications. ", "antireqs": ["MATH225", "MATH126", "MATH245"], "title": "Linear Algebra 2 for Honours Mathematics"}, "PMATH370": {"prereqs": [["MATH118", "MATH119", "MATH128", "MATH138", "MATH148"], ["MATH114", "MATH115", "MATH225", "MATH126", "MATH235", "MATH245"]], "description": "The mathematics of iterated functions, properties of discrete dynamical systems, Mandelbrot and Julia sets. ", "title": "Chaos and Fractals"}, "STAT437": {"offered": ["W"], "prereqs": [["STAT431"]], "description": "This course will provide an introduction to the principles and methods for the analysis of longitudinal data. Conditional and random effect modeling approaches to regression analysis will be covered, as well as semiparametric methods based on generalized estimating equations. Supporting statistical theory will be given at a level appropriate for a senior undergraduate student in Statistics. The importance of model assessment and parameter interpretation will be emphasized. Problems will be motivated by applications in epidemiology, clinical medicine, health services research, and disease natural history studies. Students will be required to think critically about appropriate strategies for data analysis. Analysis will be carried out with SAS and S-PLUS/R software and the importance of providing clear interpretations to data analyses will be emphasized. ", "title": "Analysis of Longitudinal Data in Health Research"}, "MATH239": {"offered": ["F", "W", "S"], "prereqs": [["MATH106!70", "MATH136", "MATH147"], ["MATH135!60", "MATH145"]], "description": "Introduction to graph theory: colourings, matchings, connectivity, planarity. Introduction to combinatorial analysis: generating series, recurrence relations, binary strings, plane trees. ", "antireqs": ["CO220", "MATH229", "MATH249"], "title": "Introduction to Combinatorics"}, "AMATH463": {"offered": ["F"], "prereqs": [["AMATH353", "PHYS364"], ["AMATH361"]], "description": "Incompressible, irrotational flow. Incompressible viscous flow. Introduction to wave motion and geophysical fluid mechanics. Elements of compressible flow. ", "title": "Fluid Mechanics"}, "CO471": {"prereqs": [["MATH239", "MATH249"], ["AMATH331", "PMATH331", "PMATH351"], ["CO255", "CO355"]], "description": "Optimization over convex sets described as the intersection of the set of symmetric, positive semidefinite matrices with affine spaces. Formulations of problems from combinatorial optimization, graph theory, number theory, probability and statistics, engineering design, and control theory. Theoretical and practical consequences of these formulations. Duality theory and algorithms.", "title": "Semidefinite Optimization"}, "CS448": {"offered": ["W"], "prereqs": [["CS348"], ["CS350", "SE350"]], "description": "The objective of this course is to introduce students to fundamentals of building a relational database management system. The course focuses on the database engine core technology by studying topics such as storage management (data layout, disk-based data structures), indexing, query processing algorithms, query optimization, transactional concurrency control, logging and recovery. ", "title": "Database Systems Implementation"}, "CS484": {"prereqs": [["AMATH242", "CM271", "CS371", "CS370"], ["STAT230", "STAT240"]], "description": "Introduction to image and vision understanding by computer. Camera-system geometry, image formation and lighting, and image acquisition. Basic visual processes for recognition of edges, regions, lines, and surfaces. Processing of stereo images, and motion in image sequences. Object recognition. Applications of computer-vision systems. ", "title": "Computational Vision"}, "AMATH342": {"offered": ["F", "W"], "prereqs": [["AMATH242", "AMATH341", "CM271", "CS371"], ["AMATH250", "AMATH251", "AMATH350", "MATH218", "MATH228"]], "description": "An introduction to numerical methods for ordinary and partial differential equations. Ordinary differential equations: multistep and Runge-Kutta methods; stability and convergence; systems and stiffness; boundary value problems. Partial differential equations: finite difference methods for elliptic, hyperbolic and parabolic equations; stability and convergence. The course focuses on introducing widely used methods and highlights applications in the natural sciences, the health sciences, engineering and finance. ", "title": "Computational Methods for Differential Equations"}, "AMATH343": {"offered": ["W"], "prereqs": [["MATH128", "MATH138", "MATH148"]], "description": "Difference equations, Laplace and z transforms applied to discrete (and continuous) mathematical models taken from ecology, biology, economics and other fields. ", "title": "Discrete Models in Applied Mathematics"}, "CS432": {"offered": ["F", "S"], "prereqs": [["CS330"]], "description": "Survey of organization and management theory. Systems theory and the systems approach. Systems design. Database concepts. Implementation and evaluation of computer based information systems. ", "antireqs": ["AFM341", "CS445", "ECE451", "MSCI444", "SE463"], "title": "Business Systems Analysis"}, "CS430": {"offered": ["F", "W"], "prereqs": [["CS330"]], "description": "An investigation into the role and function of software engineering practice in the construction of computer based systems. Topics include: requirements and specification; documentation techniques; analysis and design; implementation; testing and maintenance; management issues. ", "antireqs": ["CS446", "ECE452", "SE464"], "title": "Applications Software Engineering"}, "AMATH495": {"description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Reading Course"}, "CS436": {"offered": ["W"], "prereqs": [["CS230", "CS241", "CS246", "CS251"]], "description": "An introduction to networks, protocols, and distributed systems. Layered models, resource management, naming, addressing and routing, reliable communication, security, and higher-level services. ", "antireqs": ["CS454", "CS456", "ECE428", "CS454"], "title": "Networks and Distributed Computer Systems"}, "STAT464": {"prereqs": [["STAT333"]], "description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Topics in Probability Theory"}, "CS246": {"offered": ["F", "W", "S"], "prereqs": [["CS146", "CS136!60", "CS138"]], "description": "Introduction to object-oriented programming and to tools and techniques for software development. Designing, coding, debugging, testing, and documenting medium-sized programs: reading specifications and designing software to implement them; selecting appropriate data structures and control structures; writing reusable code; reusing existing code; basic performance issues; debuggers; test suites. ", "antireqs": ["CS247", "MSCI342", "SYDE322"], "title": "Object-Oriented Software Development"}, "CO353": {"prereqs": [["CO250", "CO350", "CO352", "CO255", "CO355", "CM340"]], "description": "Formulations of combinatorial optimization problems, greedy algorithms, dynamic programming, branch-and-bound, cutting plane algorithms, decomposition techniques in integer programming, approximation algorithms.", "title": "Computational Discrete Optimization"}, "CO480": {"offered": ["S"], "prereqs": [["MATH135", "MATH145"], ["MATH106", "MATH125", "MATH136", "MATH146"], ["MATH138", "MATH148"]], "description": "An in-depth examination of the origins of mathematics, beginning with examples of Babylonian mathematics. Topics may include Pythagorean triples, solution of equations, estimation of pi, duplication of the cube, trisection of an angle, the Fibonacci sequence, the origins of calculus. ", "title": "History of Mathematics"}, "CO487": {"offered": ["W"], "prereqs": [["MATH135", "MATH145"], ["STAT220", "STAT230", "STAT240"]], "description": "A broad introduction to cryptography, highlighting the major developments of the past twenty years. Symmetric ciphers, hash functions and data integrity, public-key encryption and digital signatures, key establishment, key management. Applications to Internet security, computer security, communications security, and electronic commerce. ", "title": "Applied Cryptography"}, "CO485": {"offered": ["F"], "prereqs": [["PMATH334", "PMATH336", "PMATH345", "PMATH346", "PMATH347"]], "description": "An in-depth study of public-key cryptography. Number-theoretic problems: prime generation, integer factorization, discrete logarithms. Public-key encryption, digital signatures, key establishment, secret sharing. Proofs of security. ", "title": "The Mathematics of Public-Key Cryptography"}, "CS245": {"offered": ["F", "W", "S"], "prereqs": [["CS136", "CS138", "CS146"], ["MATH135"]], "description": "Propositional and predicate logic. Soundness and completeness and theirimplications. Unprovability of formulae in certain systems. Undecidability of problems in computation, including the halting problem. Reasoning about programs. Correctness proofs for both recursive and iterative program constructions. ", "antireqs": ["PMATH330", "SE212"], "title": "Logic and Computation"}, "PMATH432": {"prereqs": [["PMATH345", "PMATH346", "PMATH347"]], "description": "The concepts of formal provability and logical consequence in first order logic are introduced, and their equivalence is proved in the soundness and completeness theorems. Goedel's incompleteness theorem is discussed, making use of the halting problem of computability theory. Relative computability and the Turing degrees are further studied.", "title": "First Order Logic and Computability"}, "CS247": {"offered": ["S"], "prereqs": [["CS241"]], "description": "Systematic methods for designing, coding, testing, and documenting medium-sized programs. Major topics include abstraction, modularity, software modeling, object-oriented programming and design, generic programming, testing and debugging. ", "antireqs": ["CS246", "MSCI342", "SYDE322"], "title": "Software Engineering Principles"}, "MATH103": {"offered": ["F", "W", "S"], "antireqs": ["MATH106", "MATH114", "MATH115", "MATH136", "MATH146", "NE112"], "description": "An introduction to applications of algebra to business, the behavioural sciences, and the social sciences. Topics will be chosen from linear equations, systems of linear equations, linear inequalities, functions, set theory, permutations and combinations, binomial theorem, probability theory. ", "title": "Introductory Algebra for Arts and Social Science"}, "CS241": {"offered": ["F", "W", "S"], "prereqs": [["CS246", "CS138"]], "description": "The relationship between high-level languages and the computer architecture that underlies their implementation, including basic machine architecture, assemblers, specification and translation of programming languages, linkers and loaders, block-structured languages, parameter passing mechanisms, and comparison of programming languages. ", "antireqs": ["CS230"], "title": "Foundations of Sequential Programs"}, "CS240": {"offered": ["F", "W", "S"], "prereqs": [["CS245", "SE212"], ["CS246", "CS247"], ["STAT206", "STAT230", "STAT240"]], "description": "Introduction to widely used and effective methods of data organization, focusing on data structures, their algorithms, and the performance of these algorithms. Specific topics include priority queues, sorting, dictionaries, data structures for text processing. ", "antireqs": ["BME122", "CS234", "ECE250", "MSCI240", "MTE140", "SYDE223"], "title": "Data Structures and Data Management"}, "MATH106": {"offered": ["F", "W", "S"], "prereqs": [["MATH103"]], "description": "Systems of linear equations. Matrix algebra. Determinants. Introduction to vector spaces. Applications. ", "antireqs": ["MATH114", "MATH115", "MATH136", "ATH146", "NE112"], "title": "Applied Linear Algebra 1"}, "MATH104": {"offered": ["F", "W"], "antireqs": ["MATH127", "MATH137", "MATH147"], "description": "An introduction to applications of calculus in business, the behavioural sciences, and the social sciences. The models studied will involve polynomial, rational, exponential and logarithmic functions. The major concepts introduced to solve problems are rate of change, optimization, growth and decay, and integration. ", "title": "Introductory Calculus for Arts and Social Science"}, "STAT316": {"offered": ["W"], "prereqs": [["ECON221", "ENVS278", "ISS250R", "SDS250R", "KIN222", "PSCI214", "PSCI314", "PSYCH292", "REC371", "SOC280", "LS280", "STAT*"]], "description": "This is an applications oriented course which prepares the nonmathematical student to use the computer as a research tool. Topics include aids for statistical analysis and the preparation of documents such as reports and theses. The course provides sufficient background for application to other problems specific to the individual's field. ", "antireqs": ["STAT331", "STAT371"], "title": "Introduction to Statistical Problem Solving by Computer"}, "PMATH465": {"prereqs": [["PMATH365"]], "description": "Point-set topology; smooth manifolds, smooth maps and tangent vectors; the tangent bundle; vector fields, tensor fields and differential forms. Other topics may include: de Rham cohomology; Frobenius Theorem; Riemannian metrics, connections and curvature.", "title": "Geometry of Manifolds"}, "CO250": {"offered": ["F", "W", "S"], "prereqs": [["MATH106!70", "MATH115", "MATH136", "MATH146"]], "description": "A broad introduction to the field of optimization, discussing applications and solution techniques. Mathematical models for real life applications; algorithms; aspects of computational complexity; geometry; linear programming duality, focusing on the development of algorithms. ", "antireqs": ["CO227", "CO352", "CO255", "CO355"], "title": "Introduction to Optimization"}, "PMATH360": {"prereqs": [["MATH225", "MATH126", "MATH235", "MATH245"]], "description": "An introduction to affine, projective and non-Euclidean forms of geometry. Conic sections in the projective plane. Inversion in circles. Theorems of Desargues, Pappus, and Pascal. ", "title": "Geometry"}, "PMATH367": {"prereqs": [["AMATH331", "PMATH331", "PMATH351"]], "description": "Relations, functions, well-orderings, Schroder-Bernstein theorem, recursion, axiom of choice and equivalents, ordinals, cardinals, continuum hypothesis, singular and inaccessible cardinals. Topological spaces, bases and sub-bases, closure and interior, product spaces, quotient spaces, nets and filters. Hausdorff spaces, completely regular and normal spaces, Urysohn's lemma, Tietze extension theorum. Compactness, Tychonoff's theorum, Stone-Cech compactification. Connectedness, path connectedness, Function spaces.", "title": "Set Theory & General Topology"}, "PMATH365": {"prereqs": [["AMATH231", "MATH247"], ["MATH235", "MATH245"]], "description": "Submanifolds of Euclidean n-space; vector fields and differential forms; integration on submanifolds and Stokes's Theorem; metrics and geodesics; Gauss-Bonnet Theorem.", "title": "Differential Geometry"}, "CO255": {"offered": ["W"], "prereqs": [["MATH235", "MATH245"], ["MATH237", "MATH247"]], "description": "Linear optimization: feasibility theorems, duality, the simplex algorithm. Discrete optimization: integer linear programming, cutting planes, network flows. Continuous optimization: local and global optima, feasible directions, convexity, necessary optimality conditions. ", "antireqs": ["CO227", "CO250", "CM340", "CO350", "CO352", "CO355"], "title": "Introduction to Optimization (Advanced Level)"}, "MATH247": {"offered": ["F", "W", "S"], "prereqs": [["MATH146"], ["MATH148"]], "description": "Topology of real n-dimensional space: completeness, closed and open sets, connectivity, compact sets, continuity, uniform continuity. Differential calculus on multivariable functions: partial differentiability, differentiability, chain rule, Taylor polynomials, extreme value problems. Riemann integration: Jordan content, integrability criteria, Fubini's theorem, change of variables. Local properties of continuously differentiable functions: open mapping theorem, inverse function theorem, implicit function theorem. ", "title": "Calculus 3 (Advanced Level)"}, "PMATH451": {"prereqs": [["PMATH354!60", "PMATH450!60"]], "description": "General measures, measurability, Caratheodory Extension theorem and construction of measures, integration theory, convergence theorems, Lp-spaces, absolute continuity, differentiation of monotone functions, Radon-Nikodym theorem, product measures, Fubini's theorem, signed measures, Urysohn's lemma, Riesz Representation theorems for classical Banach spaces.", "title": "Measure and Integration"}, "MATH245": {"offered": ["F", "S"], "prereqs": [["MATH146"]], "description": "MATH 245 is an advanced-level version of MATH 235. ", "antireqs": ["MATH225", "MATH126", "MATH235"], "title": "Linear Algebra 2 (Advanced Level)"}, "CS399": {"prereqs": [["CS240"], ["CS246", "CS247"]], "description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Readings in Computer Science"}, "CS398": {"prereqs": [["CS240"], ["CS246", "CS247"]], "description": "See the Course Offerings List for topics available.", "title": "Topics in Computer Science"}, "CS234": {"offered": ["F", "S"], "prereqs": [["CS116", "CS136", "CS138", "CS146"]], "description": "Top-down design of data structures. Using representation-independent data types. Introduction to commonly used data types, including lists, sets, mappings, and trees. Selection of data representation. ", "antireqs": ["BME122", "CS240", "ECE250", "MSCI240", "MTE140", "SYDE223"], "title": "Data Types and Structures"}, "AMATH351": {"offered": ["F", "S"], "prereqs": [["AMATH250", "AMATH251"], ["MATH237", "MATH247"]], "description": "Second order linear differential equations with non-constant coefficients, Sturm comparison, oscillation and separation theorems, series solutions and special functions. Linear vector differential equations in Rn, an introduction to dynamical systems. Laplace transforms applied to linear vector differential equations, transfer functions, the convolution theorem. Perturbation methods for differential equations. Numerical methods for differential equations. Applications are discussed throughout. ", "antireqs": ["AMATH350"], "title": "Ordinary Differential Equations 2"}, "AMATH350": {"offered": ["F", "W"], "prereqs": [["MATH136", "MATH146", "MATH237", "MATH247"], ["STAT230", "STAT240"], ["AFM272", "ACTSC291", "ACTSC371", "ECON371", "BUS393W"]], "description": "First order ordinary differential equations. Applications to continuous compounding and the dynamics of supply and demand. Higher order linear ordinary differential equations. Systems of linear ordinary differential equations. Introduction to linear partial differential equations. The Fourier Transform and the diffusion equation. Discussion of the Black-Scholes partial differential equations, and solutions thereof. ", "antireqs": ["AMATH250", "AMATH251", "AMATH351", "AMATH353", "CIVE222", "ENVE223", "MATH211", "ECE205", "MATH218", "MATH228", "ME203", "PHYS364", "SYDE211"], "title": "Differential Equations for Business and Economics"}, "MATH249": {"offered": ["F", "W"], "prereqs": [["MATH136", "MATH146"], ["MATH138", "MATH148"]], "description": "MATH 249 is an advanced-level version of MATH 239. ", "antireqs": ["CO220", "MATH229", "MATH239"], "title": "Introduction to Combinatorics (Advanced Level)"}, "CS487": {"offered": ["W"], "prereqs": [["CS234", "CS240", "SE240"]], "description": "An introduction to the use of computers for symbolic mathematical computation, involving traditional mathematical computations such as solving linear equations (exactly), analytic differentiation and integration of functions, and analytic solution of differential equations. ", "title": "Introduction to Symbolic Computation"}, "CS486": {"offered": ["F", "W", "S"], "prereqs": [["CM339", "CS341", "SE240"]], "description": "Goals and methods of artificial intelligence. Methods of general problem solving. Knowledge representation and reasoning. Planning. Reasoning about uncertainty. Machine learning. Multi-agent systems. Natural language processing. ", "title": "Introduction to Artificial Intelligence"}, "STAT469": {"description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Readings in Statistics 2"}, "STAT468": {"description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Readings in Statistics 1"}, "CS482": {"offered": ["W"], "prereqs": [["CM339", "CS341"], ["STAT241"], ["STAT231!60"]], "description": "Computer science principles and algorithms in biological sequence analysis. Topics include algorithms for sequence comparison, for large-scale database search in biological databases, for sequence assembly, for evolutionary tree reconstruction, for identifying important features in DNA and RNA sequences, and underlying computational techniques for understanding strings and trees and for making probabilistic inferences. ", "title": "Computational Techniques in Biological Sequence Analysis"}, "CS251": {"offered": ["F", "W", "S"], "prereqs": [["CS136", "CS138", "CS146"]], "description": "Overview of computer organization and performance. Basics of digital logic design. Combinational and sequential elements. Data representation and manipulation. Basics of processor design. Pipelining. Memory hierarchies. Multiprocessors. ", "antireqs": ["BME292", "ECE222", "ME262", "MTE262", "SYDE192"], "title": "Computer Organization and Design"}, "MATH135": {"offered": ["F", "W", "S"], "antireqs": ["MATH145"], "description": "An introduction to the language of mathematics and proof techniques through a study of the basic algebraic systems of mathematics: the integers, the integers modulo n, the rational numbers, the real numbers, the complex numbers and polynomials. ", "title": "Algebra for Honours Mathematics"}, "MATH137": {"offered": ["F", "W", "S"], "antireqs": ["MATH116", "MATH117", "MATH124", "MATH127", "MATH147"], "description": "Rational, trigonometric, exponential, and power functions of a real variable; composites and inverses. Absolute values and inequalities. Limits and continuity. Derivatives and the linear approximation. Applications of the derivative, including curve sketching, optimization, related rates, and Newton's method. The Mean Value Theorem and error bounds. Introduction to the Riemann Integral and approximations. Antiderivatives and the Fundamental Theorem. Change of variable, areas and rate integrals. Suitable topics are illustrated using computer software. ", "title": "Calculus 1 for Honours Mathematics"}, "MATH136": {"offered": ["F", "W", "S"], "prereqs": [["MATH135!60", "MATH145"]], "description": "Systems of linear equations, matrix algebra, elementary matrices, computational issues. Real n-space, vector spaces and subspaces, basis and dimension, rank of a matrix, linear transformations and matrix representations. Determinants, eigenvalues and diagonalization, applications. ", "antireqs": ["MATH106", "MATH114", "MATH115", "MATH146", "NE112"], "title": "Linear Algebra 1 for Honours Mathematics"}, "STAT467": {"description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Topics in Statistics 2"}, "STAT466": {"prereqs": [["STAT330"], ["STAT331"]], "description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Topics in Statistics 1"}, "CS489": {"description": "See the Course Offerings List for topics available.", "title": "Advanced Topics in Computer Science"}, "CS488": {"offered": ["F", "W", "S"], "prereqs": [["CM339", "CS341", "SE240"], ["CS350", "SE350"], ["CS370", "CS371"]], "description": "Software and hardware for interactive computer graphics. Implementation of device drivers, 3-D transformations, clipping, perspective, and input routines. Data structures, hidden surface removal, colour shading techniques, and some additional topics will be covered. ", "title": "Introduction to Computer Graphics"}, "PMATH446": {"prereqs": [["PMATH345", "PMATH347"], ["PMATH346", "PMATH348"]], "description": "Module theory: classification of finitely generated modules over PIDs, exact sequences and tensor products, algebras, localisation, chain conditions. Primary decomposition, integral extensions, Noether's normalisation lemma, and Hilbert's Nullstellensatz.", "title": "Introduction to Commutative Algebra"}, "PMATH445": {"prereqs": [["PMATH345"], ["PMATH346", "PMATH347"]], "description": "Basic definitions and examples: subrepresentations and irreducible representations, tensor products of representations. Character theory. Representations as modules over the group ring, Artin-Wedderburn structure theorem for semisimple rings. Induced representations, Frobenius reciprocity, Mackey's irreducibility criterion.", "title": "Representations of Finite Groups"}, "PMATH440": {"prereqs": [["PMATH352", "AMATH332", "PMATH332"]], "description": "Summation methods, analytic theory of the Riemann zeta function, Prime Number Theorem, primitive roots, quadratic reciprocity. Dirichlet characters and infinitude of primes in arithmetic progressions, and assorted topics.", "title": "Analytic Number Theory"}, "PMATH441": {"prereqs": [["PMATH345", "PMATH348"]], "description": "An introduction to algebraic number theory; unique factorization, Dedekind domains, class numbers, Dirichlet's unit theorem, solutions of Diophantine equations.", "title": "Algebraic Number Theory"}, "STAT373": {"offered": ["F"], "prereqs": [["STAT231!60", "STAT241"]], "description": "Application of regression and time series models in finance; multiple regression; algebraic and geometric representation of least squares; inference methods - confidence intervals and hypothesis tests, ANOVA, prediction; model building and assessment; time series modeling; autoregressive AR(1) models - fitting, assessment and prediction; moving average smoothing, seasonal adjustment; non-stationarity and differencing. ", "antireqs": ["STAT321", "STAT331", "STAT371", "STAT443"], "title": "Regression and Forecasting Methods in Finance"}, "STAT372": {"offered": ["F", "W", "S"], "prereqs": [["STAT231!60", "STAT241"]], "description": "Design and analysis of surveys. Management of sample and non-sample error. Simple random sampling and stratified random sampling. Additional topics in survey sampling. Observational and experimental studies. Principles for the design of experiments. Analysis of Variance, factorial experiments and interaction. Application to problems in business. ", "antireqs": ["STAT322", "STAT332"], "title": "Survey Sampling and Experimental Design Techniques for Business"}, "STAT371": {"offered": ["F", "W", "S"], "prereqs": [["MATH235", "MATH245"], ["STAT231!60", "STAT241"]], "description": "Practical and theoretical aspects of simple and multiple linear regression models. Model building, fitting and assessment. Process thinking and improvement. Strategies for variation reduction such as control charting. Process monitoring, control and adjustment. Applications to problems in business. ", "antireqs": ["ECON321", "STAT321", "STAT331", "STAT373"], "title": "Applied Linear Models and Process Improvement for Business"}, "PMATH352": {"prereqs": [["MATH247", "PMATH333"]], "description": "Analytic functions, Cauchy-Riemann equations, Goursat's theorem, Cauchy's theorems, Morera's theorem, Liouville's theorem, maximum modulus principle, harmonic functions, Schwarz's lemma, isolated singularities, Laurent series, residue theorem.", "title": "Complex Analysis"}, "PMATH351": {"prereqs": [["MATH247", "PMATH333"]], "description": "Normed and metric spaces, open sets, continuous mappings, sequence and function spaces, completeness, contraction mappings, compactness of metric spaces, finite-dimensional normed spaces, Arzela-Ascoli theorem, existence of solutions of differential equations, Stone-Weierstrass theorem.", "title": "Real Analysis"}, "MATH115": {"offered": ["F"], "antireqs": ["MATH106", "MATH125", "MATH114", "MATH136", "MATH146", "NE112"], "description": "Linear equations, matrices and determinants. Introduction to vector spaces. Eigenvalues and diagonalization. Applications. Complex numbers. ", "title": "Linear Algebra for Engineering"}, "PMATH499": {"description": "</td></tr><tr><td colspan=2><i> </i>", "title": "Readings in Pure Mathematics"}, "PMATH450": {"prereqs": [["PMATH351!60"]], "description": "Lebesgue measure on the line, the Lebesgue integral, monotone and dominated convergence theorems, Lp-spaces: completeness and dense subspaces. Separable Hilbert space, orthonormal bases. Fourier analysis on the circle, Dirichlet kernel, Riemann-Lebesgue lemma, Fejer's theorem and convergence of Fourier series.", "title": "Lebesgue Integration and Fourier Analysis"}, "CO481": {"offered": ["W"], "prereqs": [["MATH114", "MATH115", "MATH235", "MATH245"]], "description": "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution. ", "title": "Introduction to Quantum Information Processing"}, "MATH138": {"offered": ["F", "W", "S"], "prereqs": [["MATH127!70", "MATH137!60", "MATH147"]], "description": "Review of the Fundamental Theorem. Methods of integration. Further applications of the integral. Improper integrals. Linear and separable differential equations and applications. Vector (parametric) curves in R2. Convergence of sequences and series. Tests for convergence. Functions defined as power series. Taylor polynomials, Taylor's Theorem, and polynomial approximation. Taylor series. Suitable topics are illustrated using computer software. ", "antireqs": ["MATH118", "MATH119", "MATH128", "MATH148"], "title": "Calculus 2 For Honours Mathematics"}, "CS383": {"offered": ["W"], "prereqs": [["CS240"], ["FINE229"], ["FINE257"]], "description": "An upper-level studio course to create computational projects that function as art works and aesthetic experiences. Students will work in interdisciplinary teams to combine computer science principles with fine art technical and conceptual skills. ", "title": "Computational Digital Art Studio"}, "CO499": {"description": "</td></tr><tr><td colspan=2><i>Department Consent Required</i>", "title": "Reading in Combinatorics and Optimization"}, "CS146": {"offered": ["W"], "prereqs": [["CS145!75"]], "description": "CS 146 is an advanced-level version of CS 136. ", "antireqs": ["CS116", "CS136", "CS137", "CS138"], "title": "Elementary Algorithm Design and Data Abstraction (Advanced Level)"}, "CS145": {"offered": ["F"], "antireqs": ["CS115", "CS135", "CS137", "CS138"], "description": "CS 145 is an advanced-level version of CS 135. ", "title": "Designing Functional Programs (Advanced Level)"}, "CO342": {"offered": ["F", "S"], "prereqs": [["MATH239", "MATH249"]], "description": "An introduction to some of the key topics in graph theory: connectivity, planarity and matchings. Connectivity: Menger's Theorem, 3-connected graphs. Planarity: Kuratowski's Theorem, uniqueness of planar embeddings. Matchings: Review of Konig's Theorem, Tutte's Theorem. ", "title": "Introduction to Graph Theory"}, "CS490": {"offered": ["W"], "prereqs": [["CS350", "SE350"]], "description": "The integration of business and technical considerations in the design, implementation and management of information systems. Topics include: IS planning and development; business, management, executive, and strategic information systems, including case studies of selected large- scale systems; decision support systems; end-user training and development; systems security, disaster planning and recovery. Practical examples of information systems in industry. ", "title": "Information Systems Management"}, "AMATH475": {"offered": ["W"], "prereqs": [["AMATH231", "MATH227"], ["AMATH271", "PHYS263"]], "description": "Tensor analysis. Curved space-time and the Einstein field equations. The Schwarzschild solution and applications. The Friedmann-Robertson-Walker cosmological models. ", "title": "Introduction to General Relativity"}, "CS492": {"offered": ["W", "S"], "prereqs": [["CS240"]], "description": "This course is designed to consider the problems encountered by individuals, organizations and society as computer technology is adopted, with a view towards assessing possible courses of action. ", "title": "The Social Implications of Computing"}, "CS497": {"description": "See the Course Offerings list for topics available.", "title": "Multidisciplinary Studies in Computer Science"}, "CS371": {"offered": ["W", "S"], "prereqs": [["CS116", "CS136", "CS138", "CS146"], ["MATH235", "MATH245"], ["MATH237", "MATH247"]], "description": "A rigorous introduction to the field of computational mathematics. The focus is on the interplay between continuous models and their solution via discrete processes. Topics include: pitfalls in computation, solution of linear systems, interpolation, discrete Fourier transforms and numerical integration. Applications are used as motivation. ", "antireqs": ["CS335", "CS370", "MTE204"], "title": "Introduction to Computational Mathematics"}, "CO463": {"offered": ["W"], "prereqs": [["CO255", "CO355", "CO367", "CM442"], ["AMATH331", "PMATH331", "PMATH351"]], "description": "An introduction to the modern theory of convex programming, its extensions and applications. Structure of convex sets, separation and support, subgradient calculus for convex functions, Fenchel conjugacy and duality, Lagrange multipliers. Ellipsoid method for convex optimization. ", "title": "Convex Optimization and Analysis"}, "MATH127": {"offered": ["F", "W", "S"], "prereqs": [["MATH104"]], "description": "Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties and inverses. Intuitive discussion of limits and continuity. Definition and interpretation of the derivative, derivatives of elementary functions, derivative rules and applications. Riemann sums and other approximations to the definite integral. Fundamental Theorems and antiderivatives; change of variable. Applications to area, rates, average value. ", "antireqs": ["MATH109", "MATH116", "MATH117", "MATH124", "MATH137", "MATH147"], "title": "Calculus 1 for the Sciences"}, "MATH124": {"offered": ["F"], "antireqs": ["MATH109", "MATH116", "MATH117", "MATH127", "MATH137", "MATH147"], "description": "Review of trigonometry and basic algebra. Introduction to vectors in 2- and 3-space: sums, addition, dot products, cross products and angles between vectors. Solving linear systems in two and three variables. Functions of a real variable: powers, rational functions, trigonometric, exponential and logarithmic functions, their properties. Intuitive discussion of limits and continuity. Derivatives of elementary functions, derivative rules; applications to curve sketching, optimization. Relationships between distance, velocity and acceleration. The definite integral, antiderivatives, the Fundamental Theorem of Calculus; change of variable and integration by parts; applications to area, centre of mass. ", "title": "Calculus and Vector Algebra for Kinesiology"}, "CO466": {"prereqs": [["CO367", "CM442", "CO255", "CO355"], ["CO250", "CO350", "CO352", "CM340"]], "description": "Numerical algorithms for nonlinear optimization. Newton, variable-metric, quasi-Newton and conjugate gradient methods. Obtaining derivatives. Convexity. Trust region methods. Constrained optimization including optimality conditions, sequential quadratic programming, interior point and active set strategies.", "title": "Continuous Optimization"}, "STAT206": {"offered": ["F"], "prereqs": [["MATH115"], ["MATH119"]], "description": "Empirical problem solving with applications to software engineering. An introduction to probability theory. An introduction to distribution theory and to methods of statistical inference, including confidence intervals and hypothesis testing. An introduction to regression. ", "title": "Statistics for Software Engineering"}, "STAT333": {"offered": ["F", "W", "S"], "prereqs": [["STAT230!60", "STAT240"]], "description": "Review of basic probability. Generating functions. Theory of recurrent events. Markov chains, Markov processes, and their applications. ", "antireqs": ["STAT334"], "title": "Applied Probability"}, "MATH148": {"offered": ["W"], "prereqs": [["MATH147"]], "description": "MATH 148 is an advanced-level version of MATH 138. ", "antireqs": ["MATH118", "MATH119", "MATH128", "MATH138"], "title": "Calculus 2 (Advanced Level)"}, "STAT202": {"offered": ["F", "W"], "antireqs": ["STAT220", "STAT230"], "description": "Elementary probability, populations, samples and distributions with biological examples. Methods for data summary and presentation. Estimation, hypothesis testing, two-sample techniques and paired comparisons, regression, correlation. ", "title": "Introductory Statistics for Scientists"}, "PMATH347": {"prereqs": [["MATH235", "MATH245"]], "description": "Groups, subgroups, homomorphisms and quotient groups, isomorphism theorems, group actions, Cayley and Lagrange theorems, permutation groups and the fundamental theorem of finite abelian groups. Elementary properties of rings, subrings, ideals, homomorphisms and quotients, isomorphism theorems, polynomial rings, and unique factorization domains.", "title": "Groups and Rings"}, "MATH145": {"offered": ["F"], "antireqs": ["MATH135"], "description": "MATH 145 is an advanced-level version of MATH 135. ", "title": "Algebra (Advanced Level)"}, "MATH146": {"offered": ["W"], "prereqs": [["MATH145"]], "description": "MATH 146 is an advanced-level version of MATH 136. ", "antireqs": ["MATH106", "MATH114", "MATH115", "MATH136", "NE112"], "title": "Linear Algebra 1 (Advanced level)"}, "MATH147": {"offered": ["F"], "antireqs": ["MATH116", "MATH117", "MATH124", "MATH127", "MATH137"], "description": "MATH 147 is an advanced-level version of MATH 137. ", "title": "Calculus 1 (Advanced Level)"}, "MATH128": {"offered": ["F", "W", "S"], "prereqs": [["MATH117", "MATH127", "MATH137", "MATH147"]], "description": "Transforming and evaluating integrals; application to volumes and arc length; improper integrals. Separable and linear first order differential equations and applications. Introduction to sequences. Convergence of series; Taylor polynomials, Taylor's Remainder Theorem, Taylor series and applications. Parametric/vector representation of curves; particle motion and arc length. Polar coordinates in the plane. ", "antireqs": ["MATH118", "MATH119", "MATH138", "MATH148"], "title": "Calculus 2 for the Sciences"}, "AMATH231": {"offered": ["F", "W", "S"], "prereqs": [["MATH237", "MATH247"]], "description": "Vector integral calculus-line integrals, surface integrals and vector fields, Green's theorem, the Divergence theorem, and Stokes' theorem. Applications include conservation laws, fluid flow and electromagnetic fields. An introduction to Fourier analysis. Fourier series and the Fourier transform. Parseval's formula. Frequency analysis of signals. Discrete and continuous spectra. ", "antireqs": ["MATH207", "MATH212", "ECE206", "MATH217", "MATH227"], "title": "Calculus 4"}, "STAT444": {"offered": ["W"], "prereqs": [["CM361", "STAT341", "STAT331", "STAT371"]], "description": "Methods for finding surfaces in high dimensions from incomplete or noisy functional information. Both data adaptive and methods based on fixed parametric structure will be treated. Model assessment, training and tuning. ", "title": "Statistical Learning - Function Estimation"}, "STAT430": {"offered": ["F", "S"], "prereqs": [["STAT331", "STAT371"], ["STAT332", "STAT372"]], "description": "Review of experimental designs in a regression setting; analysis of variance; replication, balance, blocking, randomization, and interaction; one-way layout, two-way layout, and Latin square as special cases; factorial structure of treatments; covariates; treatment contrasts; two-level fractional factorial designs; fixed versus random effects; split-plot and repeated-measures designs; other topics. ", "antireqs": ["BIOL461", "PSYCH391"], "title": "Experimental Design"}, "STAT441": {"offered": ["F"], "prereqs": [["CM361", "STAT341", "STAT330"], ["STAT340"]], "description": "Given known group membership, methods which learn from data how to classify objects into the groups are treated. Review of likelihood and posterior based discrimination. Main topics include logistic regression, neural networks, tree-based methods and nearest neighbour methods. Model assessment, training and tuning. ", "title": "Statistical Learning - Classification"}, "STAT440": {"offered": ["W"], "prereqs": [["CM361", "STAT341", "CS437", "STAT340"]], "description": "Introduction to and application of computational methods in statistical inference. Monte Carlo evaluation of statistical procedures, exploration of the likelihood function through graphical and optimization techniques including EM. Bootstrapping, Markov Chain Monte Carlo, and other computationally intensive methods. ", "title": "Computational Inference"}, "STAT443": {"offered": ["F", "W", "S"], "prereqs": [["STAT331", "STAT371", "SYDE334"]], "description": "Model building. Multiple regression and forecasting. Exponential smoothing. Box-Jenkins models. Smoothing of seasonal data. ", "antireqs": ["STAT321", "STAT373"], "title": "Forecasting"}, "STAT442": {"offered": ["F"], "prereqs": [["STAT231", "STAT241"]], "description": "Visualization of high dimensional data including interactive methods directed at exploration and assessment of structure and dependencies in data. Methods for finding groups in data including traditional and modern methods of cluster analysis. Dimension reduction methods including multi-dimensional scaling, nonlinear and other methods. ", "title": "Data Visualization"}, "AMATH332": {"offered": ["W", "S"], "prereqs": [["MATH237", "MATH247"]], "description": "Complex numbers, Cauchy-Riemann equations, analytic functions, conformal maps and applications to the solution of Laplace's equation, contour integrals, Cauchy integral formula, Taylor and Laurent expansions, residue calculus and applications. ", "antireqs": ["PHYS365"], "title": "Applied Complex Analysis"}, "AMATH331": {"offered": ["F", "W"], "prereqs": [["MATH237", "MATH247"]], "description": "Topology of Euclidean spaces, continuity, norms, completeness. Contraction mapping principle. Fourier series. Various applications, for example, to ordinary differential equations, optimization and numerical approximation. ", "title": "Applied Real Analysis"}, "MATH109": {"prereqs": [["MATH104"]], "description": "Review and extension of differential calculus for functions of one variable. Multivariable differential calculus. Partial derivatives, the Chain Rule, maxima and minima and Lagrange multipliers. Introduction to matrix algebra.", "antireqs": ["ECON211", "MATH116", "MATH117", "MATH124", "MATH127", "MATH137", "MATH147"], "title": "Mathematics for Accounting"}, "PMATH340": {"prereqs": [["MATH225", "MATH126", "MATH135", "MATH145"]], "description": "An elementary approach to the theory of numbers; the Euclidean algorithm, congruence equations, multiplicative functions, solutions to Diophantine equations, continued fractions, and rational approximations to real numbers. ", "title": "Elementary Number Theory"}, "MATH97": {"description": "For studies at other universities under approved exchange agreements.", "title": "Study Abroad"}, "CS370": {"offered": ["F", "W", "S"], "prereqs": [["MATH118", "MATH119", "MATH128", "MATH138", "MATH148"], ["MATH114", "MATH115", "MATH106", "MATH136", "MATH146"], ["CS234", "CS241", "CS246"]], "description": "Principles and practices of basic numerical computation as a key aspect of scientific computation. Visualization of results. Approximation by splines, fast Fourier transforms, solution of linear and nonlinear equations, differential equations, floating point number systems, error, stability. Presented in the context of specific applications to image processing, analysis of data, scientific modeling. ", "antireqs": ["AMATH242", "CM271", "CS371", "CS335", "MTE204"], "title": "Numerical Computation"}, "PMATH467": {"prereqs": [["PMATH346", "PMATH347"], ["PMATH351", "PMATH367"]], "description": "Topological spaces and topological manifolds; quotient spaces; cut and paste constructions; classification of two-dimensional manifolds; fundamental group; homology groups. Additional topics may include: covering spaces; homotopy theory; selected applications to knots and combinatorial group theory.", "title": "Algebraic Topology"}, "CS467": {"offered": ["W"], "prereqs": [["MATH114", "MATH115", "MATH235", "MATH245"]], "description": "Basics of computational complexity; basics of quantum information; quantum phenomena; quantum circuits and universality; relationship between quantum and classical complexity classes; simple quantum algorithms; quantum Fourier transform; Shor factoring algorithm; Grover search algorithm; physical realization of quantum computation; error-correction and fault-tolerance; quantum key distribution. ", "title": "Introduction to Quantum Information Processing"}, "CS466": {"offered": ["F", "S"], "prereqs": [["CM339", "CS341"]], "description": "Algorithmic approaches and methods of assessment that reflect a broad spectrum of criteria, including randomized algorithms, amortized analysis, lower bounds, approximation algorithms, and on-line algorithms. Particular examples will be chosen from different areas of active research and application. ", "title": "Algorithm Design and Analysis"}, "CS462": {"offered": ["W"], "prereqs": [["CS360", "CS365"]], "description": "Languages and their representations. Grammars --Chomsky hierarchy. Regular sets and sequential machines. Context-free grammars -- normal forms, basic properties. Pushdown automata and transducers. Operations on languages. Undecidable problems in language theory. Applications to the design of programming languages and compiler construction.", "title": "Formal Languages and Parsing"}}